<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"efe3aced81a36db4d763022a3c1e597f70e27cddca62dc66fa00f1dbad2017de","plan_job_ref":"Job Plan Airflow DAGs #514 at https://github.com/cal-itp/data-infra/actions/runs/17249959780","plan_out_hash":"f9af1e1d4787114ec2c199278e5dcddd9bacc2e100dec8b9a41d8730c6840479","plan_hash":"4d6b99cdbb8b5945a0b1f9492432c6caba3c30df31519ad0235f97817a31ecf6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_api/ridership/complete_monthly_ridership_with_adjustments_and_estimates.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_ntd_data_api/ridership/complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_ntd_data_api/ridership/complete_monthly_ridership_with_adjustments_and_estimates.yml"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #514](https://github.com/cal-itp/data-infra/actions/runs/17249959780)